In [1]:
import pandas as pd

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

users = pd.read_csv(url, sep='|',index_col='user_id')

In [3]:
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [4]:
counts = users.occupation.value_counts()
counts

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [5]:
largest_categories = counts.head(3).index
largest_categories

Index(['student', 'other', 'educator'], dtype='object')

In [8]:
users[users.occupation.isin(largest_categories)].head(10)

         age gender occupation zip_code
user_id
2         53      F      other    94043
5         33      F      other    15213
9         29      M    student    01002
11        39      F      other    30329
12        28      F      other    06405
13        47      M   educator    29206
15        49      F   educator    97301
18        35      F      other    37212
30         7      M    student    55436
32        28      F    student    78741